## Dataset : Adult dataset

In [3]:
#import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

pd.set_option("display.max.columns",100)

In [4]:
#import dataset:

data= pd.read_csv(r'C:\Users\nikkitha.venkatesan\OneDrive - Shell\Fitness\Python_Practise\datasets\adult.data.csv')

In [5]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

#### 1. How many men and women (sex feature) are represented in this dataset?

In [7]:
data.sex.value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

#### 2. What is the average age (age feature) of women?

In [12]:
np.round(data[data['sex']=='Female'].age.mean(),0)

37.0

#### 3. What is the percentage of German citizens (native-country feature)

In [26]:
np.round((data[data['native-country']=='Germany']['native-country'].count()/data.count(axis=0)[0])*100,2)

0.42

#### 4-5. What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?

In [28]:
data.salary.unique()

array(['<=50K', '>50K'], dtype=object)

In [33]:
print(np.mean(data[data['salary']=='>50K']['age']))
print(np.mean(data[data['salary']=='<=50K']['age']))
print(np.std(data[data['salary']=='>50K']['age']))
print(np.std(data[data['salary']=='<=50K']['age']))

44.24984058155847
36.78373786407767
10.518356927661575
14.019804910115214

#### 6. Is it true that people who earn more than 50K have at least high school education? (education â€“ Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [35]:
#answer is false:
data[data['salary']=='>50K']['education'].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

#### 7. Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.

In [39]:
data.groupby(['race'])['age'].describe()

,count,mean,std,min,25%,50%,75%,max
race,,,,,,,,
Amer-Indian-Eskimo,311.0,37.173633,12.447130,17.0,28.0,35.0,45.5,82.0
Asian-Pac-Islander,1039.0,37.746872,12.825133,17.0,28.0,36.0,45.0,90.0
Black,3124.0,37.767926,12.759290,17.0,28.0,36.0,46.0,90.0
Other,271.0,33.457565,11.538865,17.0,25.0,31.0,41.0,77.0
White,27816.0,38.769881,13.782306,17.0,28.0,37.0,48.0,90.0

In [40]:
data.groupby(['race'])['sex'].describe()

                    count unique   top   freq
race
Amer-Indian-Eskimo    311      2  Male    192
Asian-Pac-Islander   1039      2  Male    693
Black                3124      2  Male   1569
Other                 271      2  Male    162
White               27816      2  Male  19174

#### 8. Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors

In [45]:
labels = ['Married-civ-spouse', 'Married-spouse-absent' , 'Married-AF-spouse'] 
data['marital_class'] = np.where((data['marital-status'].isin(labels))==True,'Married','Bachelor')

In [48]:
data.groupby(['salary','marital_class']).size().reset_index()

#answer is married

  salary marital_class      0
0  <=50K      Bachelor  16039
1  <=50K       Married   8681
2   >50K      Bachelor   1105
3   >50K       Married   6736

#### 9. What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

In [49]:
data.describe()
#max hours per week = 99

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [52]:
#people who work max hours = 85
data[data['hours-per-week']>=99].count()[0]

85

In [62]:
(data[(data['salary']=='>50K') & (data['hours-per-week']>=99)].count()[0]/data[data['hours-per-week']>=99].count()[0])*100

#answer for percentage is 29.4 percent

29.411764705882355

#### 10. Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?

In [65]:
data[data['native-country']=='Japan'].groupby(['native-country','salary'])['hours-per-week'].mean().reset_index()

  native-country salary  hours-per-week
0          Japan  <=50K       41.000000
1          Japan   >50K       47.958333